%反馈调节器u(k）=0.33y(k)+0.033y(k-1)-0.4y(k-2)有非零反馈干扰
%----------------仿真系统模型：y(k)+1.4y(k-1)+0.45y(k-2)=u(k-1)+0.7u(k-1)+e(k)----------------%
%----------------具有渐消记忆的最小二乘递推算法---------------------%
clc;
clear all;
%-----------生成两列不相关的白噪声-----------------%
e1=randn(1,2000);
e2=randn(1,2000);
%-----------产生输入输出数据-----------%
u=zeros(2002,1);
y=zeros(2002,1);
u(1)=1;
u(2)=1;
y(1)=0;
y(2)=0;  %取初值
for i=3:2002
     u(i)=0.33*y(i)+0.033*y(i-1)-0.4*y(i-2)+e2(i-2);
     y(i)=u(i-1)+0.7*u(i-2)-1.4*y(i-1)-0.45*y(i-2)+e1(i-2);
end
%-----------最小二乘递推2000步算法-----------%
p=1-1/2000;  %p为遗忘因子
Pn=10^4*eye(4);
W=zeros(4,2001);  %W为系统参数组成矩阵
W(:,1)=[3;3;3;3];
D=zeros(4,2001);
D(:,1)=[Pn(1,1),Pn(2,2),Pn(3,3),Pn(4,4)];
K=zeros(4,2000);  %增益矩阵
K(:,1)=[10;10;10;10];  %初值
%-----------开始递推-----------%
for i=3:2002
    h=[-y(i-1);-y(i-2);u(i-1);u(i-2)];
    K=Pn*h*inv(h'*Pn*h+1);
    W(:,i-1)=W(:,i-2)+K*(y(i)-h'*W(:,i-2));
    Pn=(1/p)*(eye(4)-K*h')*Pn;
    D(:,i-1)=[Pn(1,1),Pn(2,2),Pn(3,3),Pn(4,4)];
end
%-----------输出辨识的参数结果-----------%
a1=W(1,2000)
a2=W(2,2000)
a3=W(3,2000)
a4=W(4,2000)
i=1:2001;
figure(1)
plot(i,W(1,:),i,W(2,:),i,W(3,:),i,W(4,:))
title('待估计参数过渡过程')
figure(2)
plot(i,D(1,:),i,D(2,:),i,D(3,:),i,D(4,:))
title('估计方差变化过程 ')
